[
  {
    "slug": "functions",
    "title": "Functions",
    "description": "Reusable blocks of code that perform specific tasks. Functions are the building blocks of programming.",
    "content_markdown": "# Functions\n\nFunctions are like little machines - you tell them to do something, and they do it. They're one of the most fundamental concepts in programming.\n\nYou'll use functions throughout your coding journey to make things happen, from moving characters to drawing shapes.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "welcome-to-jiki"
  },
  {
    "slug": "function-inputs",
    "title": "Function Inputs",
    "description": "Passing extra information to functions to control their behavior.",
    "content_markdown": "# Function Inputs\n\nFunction inputs (also called arguments) let you give extra information to a function so it can do different things each time.\n\nFor example, instead of always moving one step, you can tell a function how many steps to take.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "functions-taking-inputs"
  },
  {
    "slug": "return-values",
    "title": "Return Values",
    "description": "Functions that give information back to you after doing their work.",
    "content_markdown": "# Return Values\n\nSome functions don't just do something - they give you information back. This is called returning a value.\n\nFor example, a function might roll a dice and return the number it landed on, so you can use that number in your code.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "functions-that-return-things-video"
  },
  {
    "slug": "custom-functions",
    "title": "Custom Functions",
    "description": "Writing your own reusable functions to organize and simplify your code.",
    "content_markdown": "# Custom Functions\n\nSo far you've been using functions that already exist. Now it's time to write your own!\n\nCreating your own functions lets you package up code you use often and give it a meaningful name.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "writing-your-own-functions"
  },
  {
    "slug": "parameters",
    "title": "Parameters",
    "description": "Adding inputs to your own functions so they can work with different data.",
    "content_markdown": "# Parameters\n\nParameters let your custom functions accept inputs. When you define a function, you list the parameters it expects, and when you call it, you pass in the actual values.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "adding-inputs-to-functions"
  },
  {
    "slug": "returns",
    "title": "Returns",
    "description": "Making your own functions give back results using return statements.",
    "content_markdown": "# Returns\n\nThe return statement lets your custom functions send a value back to the code that called them. This turns your functions into useful tools that produce results.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "adding-returns-to-functions"
  },
  {
    "slug": "function-composition",
    "title": "Function Composition",
    "description": "Combining multiple functions together to solve complex problems.",
    "content_markdown": "# Function Composition\n\nFunction composition is about breaking a big problem into smaller pieces, writing a function for each piece, and then combining them together.\n\nThis is one of the most powerful ideas in programming - building complex behavior from simple parts.",
    "parent_slug": "functions",
    "unlocked_by_lesson_slug": "using-multiple-functions-together"
  },
  {
    "slug": "variables",
    "title": "Variables",
    "description": "Named containers that store values for later use in your programs.",
    "content_markdown": "# Variables\n\nVariables are like labeled boxes where you can store information. You give the box a name, put a value inside, and then use that name whenever you need the value.\n\nVariables make your code flexible and easier to understand.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "creating-and-using-variables"
  },
  {
    "slug": "arithmetic",
    "title": "Arithmetic",
    "description": "Doing maths with variables using addition, subtraction, multiplication and division.",
    "content_markdown": "# Arithmetic\n\nArithmetic lets you do maths in your programs. You can add, subtract, multiply and divide values, and store the results in variables.\n\nThis is essential for positioning things, calculating sizes, and working with numbers.",
    "parent_slug": "variables",
    "unlocked_by_lesson_slug": "arithmetic-and-variables"
  },
  {
    "slug": "state",
    "title": "State",
    "description": "Updating variables over time to track changing values in your programs.",
    "content_markdown": "# State\n\nState is about values that change as your program runs. By updating variables inside loops, you can track positions, count things, and create dynamic behavior.\n\nUnderstanding state is key to building programs that do interesting things over time.",
    "parent_slug": "variables",
    "unlocked_by_lesson_slug": "updating-variables"
  },
  {
    "slug": "strings",
    "title": "Strings",
    "description": "Working with text in your programs using strings.",
    "content_markdown": "# Strings\n\nStrings are how programs represent text. Anything inside quotes is a string - names, colours, messages, and more.\n\nYou'll use strings whenever your program needs to work with text.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "strings-intro"
  },
  {
    "slug": "string-concatenation",
    "title": "String Concatenation",
    "description": "Joining bits of text together to build longer strings.",
    "content_markdown": "# String Concatenation\n\nConcatenation means joining strings together. You can combine fixed text with variables to build up messages, labels, and other text dynamically.",
    "parent_slug": "strings",
    "unlocked_by_lesson_slug": "string-concatenation-and-templates"
  },
  {
    "slug": "string-templates",
    "title": "String Templates",
    "description": "Using template literals to embed expressions inside strings.",
    "content_markdown": "# String Templates\n\nTemplate literals (template strings) provide a cleaner way to build strings that include variables and expressions. Instead of joining strings with +, you embed values directly inside the text.",
    "parent_slug": "strings",
    "unlocked_by_lesson_slug": "string-concatenation-and-templates"
  },
  {
    "slug": "string-indexing",
    "title": "String Indexing",
    "description": "Accessing individual characters in a string by their position.",
    "content_markdown": "# String Indexing\n\nEvery character in a string has a position (index), starting from 0. You can access any character by its index, which is essential for working with text character by character.",
    "parent_slug": "strings",
    "unlocked_by_lesson_slug": "string-indexing"
  },
  {
    "slug": "string-iteration",
    "title": "String Iteration",
    "description": "Going through a string one character at a time using loops.",
    "content_markdown": "# String Iteration\n\nString iteration means looping through a string character by character. This lets you examine, count, transform, or search through text.\n\nCombining loops with string indexing opens up a whole world of text processing.",
    "parent_slug": "strings",
    "unlocked_by_lesson_slug": "iterating-through-strings"
  },
  {
    "slug": "colors",
    "title": "Colors",
    "description": "Using color names and values to add color to your programs.",
    "content_markdown": "# Colors\n\nColors bring your programs to life! You can specify colors by name (like \"red\" or \"blue\") to change the appearance of shapes and drawings.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "strings-intro"
  },
  {
    "slug": "hsl",
    "title": "HSL Colors",
    "description": "Specifying colors using Hue, Saturation and Lightness values.",
    "content_markdown": "# HSL Colors\n\nHSL stands for Hue, Saturation, and Lightness. It's an intuitive way to specify colors:\n\n- **Hue**: The color (0-360, like a color wheel)\n- **Saturation**: How vivid the color is (0-100%)\n- **Lightness**: How light or dark (0-100%)",
    "parent_slug": "colors",
    "unlocked_by_lesson_slug": "colors-hsl-and-rgb"
  },
  {
    "slug": "rgb",
    "title": "RGB Colors",
    "description": "Specifying colors using Red, Green and Blue values.",
    "content_markdown": "# RGB Colors\n\nRGB stands for Red, Green, and Blue. Every color on screen is made by mixing these three colors in different amounts (0-255 each).",
    "parent_slug": "colors",
    "unlocked_by_lesson_slug": "colors-hsl-and-rgb"
  },
  {
    "slug": "loops",
    "title": "Loops",
    "description": "Repeating code multiple times to avoid writing the same thing over and over.",
    "content_markdown": "# Loops\n\nLoops let you repeat code without writing it out multiple times. They're one of the most powerful tools in programming, essential for processing data, creating patterns, and automating repetitive tasks.",
    "parent_slug": null
  },
  {
    "slug": "repeat",
    "title": "Repeat Loop",
    "description": "The simplest loop - repeat a block of code a specific number of times.",
    "content_markdown": "# Repeat Loop\n\nThe repeat loop is the simplest way to run code multiple times. You tell it how many times to repeat, and it does the rest.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "introducing-repeat-loop"
  },
  {
    "slug": "nested-loops",
    "title": "Nested Loops",
    "description": "Putting loops inside other loops for multi-dimensional repetition.",
    "content_markdown": "# Nested Loops\n\nNested loops are loops inside other loops. The inner loop runs completely for each iteration of the outer loop.\n\nThis is essential for working with grids, rows and columns, and other two-dimensional patterns.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "loops-in-loops"
  },
  {
    "slug": "repeat-while",
    "title": "Repeat While",
    "description": "Looping without knowing in advance how many times to repeat.",
    "content_markdown": "# Repeat While\n\nSometimes you don't know how many times to loop. Repeat-while keeps going until a condition tells it to stop.\n\nThis is perfect for situations where you need to keep trying until something works.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "repeat-without-input"
  },
  {
    "slug": "for-loop",
    "title": "For Loop",
    "description": "A more powerful loop with a counter variable, condition, and increment step.",
    "content_markdown": "# For Loop\n\nThe for loop gives you full control over iteration with three parts: initialization, condition, and update. It's the standard loop in most programming languages.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "advanced-loops-video"
  },
  {
    "slug": "break",
    "title": "Break",
    "description": "Exiting a loop early when a condition is met.",
    "content_markdown": "# Break\n\nThe break statement lets you exit a loop immediately, even if the loop hasn't finished all its iterations. This is useful when you've found what you're looking for.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "advanced-loops-video"
  },
  {
    "slug": "continue",
    "title": "Continue",
    "description": "Skipping to the next iteration of a loop.",
    "content_markdown": "# Continue\n\nThe continue statement skips the rest of the current loop iteration and jumps to the next one. This is useful when you want to skip certain items.",
    "parent_slug": "loops",
    "unlocked_by_lesson_slug": "advanced-loops-video"
  },
  {
    "slug": "conditionals",
    "title": "Conditionals",
    "description": "Making decisions in your code based on different conditions.",
    "content_markdown": "# Conditionals\n\nConditionals let your program make decisions. Instead of always doing the same thing, your code can check conditions and choose what to do based on the result.",
    "parent_slug": null
  },
  {
    "slug": "if",
    "title": "If Statements",
    "description": "Running code only when a condition is true.",
    "content_markdown": "# If Statements\n\nThe if statement is the most basic conditional. It checks a condition and only runs the code inside if that condition is true.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "if-statements-video"
  },
  {
    "slug": "else",
    "title": "Else",
    "description": "Providing an alternative action when a condition is false.",
    "content_markdown": "# Else\n\nThe else clause provides code that runs when the if condition is false. Together, if-else lets you handle both outcomes of a decision.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "else-and-else-if"
  },
  {
    "slug": "else-if",
    "title": "Else If",
    "description": "Checking multiple conditions in sequence.",
    "content_markdown": "# Else If\n\nElse-if lets you check multiple conditions one after another. The first condition that is true gets its code executed, and the rest are skipped.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "else-and-else-if"
  },
  {
    "slug": "and",
    "title": "And",
    "description": "Combining conditions so both must be true.",
    "content_markdown": "# And\n\nThe AND operator combines two conditions. Both conditions must be true for the combined result to be true.\n\nThis is useful when you need to check multiple things at once.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "and-or-video"
  },
  {
    "slug": "or",
    "title": "Or",
    "description": "Combining conditions so at least one must be true.",
    "content_markdown": "# Or\n\nThe OR operator combines two conditions. At least one condition must be true for the combined result to be true.\n\nThis is useful when there are multiple acceptable options.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "and-or-video"
  },
  {
    "slug": "modulo",
    "title": "Modulo",
    "description": "Finding the remainder after division, useful for checking even/odd and patterns.",
    "content_markdown": "# Modulo\n\nThe modulo operator (%) gives you the remainder after division. It's surprisingly useful - you can check if a number is even or odd, create repeating patterns, and more.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "modulo-and-not"
  },
  {
    "slug": "not",
    "title": "Not",
    "description": "Flipping a condition from true to false or vice versa.",
    "content_markdown": "# Not\n\nThe NOT operator flips a boolean value. True becomes false, and false becomes true. It's useful when you want to check for the opposite of a condition.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "modulo-and-not"
  },
  {
    "slug": "conditionals-and-state",
    "title": "Conditionals and State",
    "description": "Combining conditions with changing variables to create dynamic behavior.",
    "content_markdown": "# Conditionals and State\n\nWhen you combine conditionals with state (changing variables), your programs can make different decisions as they run. This is how you create truly dynamic, responsive programs.",
    "parent_slug": "conditionals",
    "unlocked_by_lesson_slug": "using-if-and-state"
  },
  {
    "slug": "arrays",
    "title": "Arrays",
    "description": "Storing collections of data in ordered lists.",
    "content_markdown": "# Arrays\n\nArrays (also called lists) let you store multiple values in a single variable. Each value has a position (index) and you can loop through them, search them, and modify them.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "arrays-intro"
  },
  {
    "slug": "array-building",
    "title": "Building Arrays",
    "description": "Creating arrays by adding elements one at a time.",
    "content_markdown": "# Building Arrays\n\nSometimes you need to build an array piece by piece rather than defining it all at once. You start with an empty array and add elements as you go.",
    "parent_slug": "arrays",
    "unlocked_by_lesson_slug": "building-arrays"
  },
  {
    "slug": "array-collecting",
    "title": "Collecting from Arrays",
    "description": "Picking out specific elements from an array that match certain criteria.",
    "content_markdown": "# Collecting from Arrays\n\nCollecting means going through an array and picking out just the elements you need. This combines loops, conditionals, and array building to filter and transform data.",
    "parent_slug": "arrays",
    "unlocked_by_lesson_slug": "collecting-from-arrays"
  },
  {
    "slug": "dictionaries",
    "title": "Dictionaries",
    "description": "Storing data with named labels instead of numbered positions.",
    "content_markdown": "# Dictionaries\n\nDictionaries (also called objects or maps) store data as key-value pairs. Instead of accessing data by position like arrays, you access it by name.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "dictionaries-intro"
  },
  {
    "slug": "dictionary-mutation",
    "title": "Changing Dictionaries",
    "description": "Updating, adding, and removing entries in dictionaries.",
    "content_markdown": "# Changing Dictionaries\n\nDictionaries can be modified after creation. You can add new key-value pairs, update existing values, and remove entries.",
    "parent_slug": "dictionaries",
    "unlocked_by_lesson_slug": "changing-dictionaries"
  },
  {
    "slug": "dictionary-building",
    "title": "Building Dictionaries",
    "description": "Creating dictionaries from scratch by adding entries one at a time.",
    "content_markdown": "# Building Dictionaries\n\nJust like arrays, you can build dictionaries piece by piece. Start with an empty dictionary and add key-value pairs as you process data.",
    "parent_slug": "dictionaries",
    "unlocked_by_lesson_slug": "building-dictionaries"
  },
  {
    "slug": "objects",
    "title": "Objects",
    "description": "Bundling related data together into structured groups.",
    "content_markdown": "# Objects\n\nObjects let you bundle related data together into a single structure. Instead of having separate variables for each piece of information, you group them together.",
    "parent_slug": null
  },
  {
    "slug": "object-properties",
    "title": "Object Properties",
    "description": "Accessing and working with data stored inside objects.",
    "content_markdown": "# Object Properties\n\nProperties are the individual pieces of data stored inside an object. You access them using dot notation to read, update, and use the values.",
    "parent_slug": "objects"
  },
  {
    "slug": "object-references",
    "title": "Object References",
    "description": "Understanding how objects are shared between functions and variables.",
    "content_markdown": "# Object References\n\nWhen you pass an object to a function or assign it to another variable, you're sharing the same object - not making a copy. Understanding this is important for avoiding unexpected behavior.",
    "parent_slug": "objects"
  },
  {
    "slug": "animation",
    "title": "Animation",
    "description": "Making things move on screen by updating positions over time.",
    "content_markdown": "# Animation\n\nAnimation is about making things move. By drawing something, changing its position, and drawing it again, you create the illusion of movement.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "animation-intro"
  },
  {
    "slug": "random",
    "title": "Random Numbers",
    "description": "Adding randomness and unpredictability to your programs.",
    "content_markdown": "# Random Numbers\n\nRandom numbers add unpredictability to your programs. They're used for games, simulations, generative art, and anywhere you want variety.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "random-numbers"
  },
  {
    "slug": "scope",
    "title": "Scope",
    "description": "Understanding where variables can be accessed in your code.",
    "content_markdown": "# Scope\n\nScope determines where a variable exists and can be used. Variables created inside a block (like a loop or function) only exist within that block.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "scope-intro"
  },
  {
    "slug": "scenarios",
    "title": "Scenarios",
    "description": "Running your code with different starting conditions to test it thoroughly.",
    "content_markdown": "# Scenarios\n\nScenarios let you test your code with different inputs and starting conditions. This ensures your solution works in all cases, not just one specific situation.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "scenarios-intro"
  },
  {
    "slug": "methods",
    "title": "Methods",
    "description": "Built-in functions that come attached to data types.",
    "content_markdown": "# Methods\n\nMethods are functions that belong to a piece of data. You call them using dot notation. For example, strings have methods like `.toUpperCase()` and `.includes()`.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "methods-and-properties-video"
  },
  {
    "slug": "properties",
    "title": "Properties",
    "description": "Built-in values attached to data types, like the length of a string.",
    "content_markdown": "# Properties\n\nProperties are values attached to data. Unlike methods, you don't call them with parentheses. For example, `.length` tells you how many characters are in a string.",
    "parent_slug": null,
    "unlocked_by_lesson_slug": "methods-and-properties-video"
  }
]
